HIERARCHY_COLUMNS = ["攝", "呼", "等", "韻", "入", "調", "清濁", "系", "組", "母"]

COLUMN_VALUES = {
    "攝": ['假', '咸', '宕', '山', '效', '曾', '果', '梗', '止', '江', '流', '深', '臻', '蟹', '通', '遇'],
    "呼": ['合', '開'],
    "等": ['一', '三', '二', '四'],
    "韻": ['之', '仙', '佳', '侯', '侵', '元', '先', '冬', '凡', '刪', '咍', '咸', '唐', '嚴', '夬', '宵', '寒',
           '尤', '山', '幽', '庚', '廢', '微', '支', '文', '東', '桓', '模', '欣', '歌', '江', '泰', '添', '清',
           '灰', '痕', '登', '皆', '真', '祭', '耕', '肴', '脂', '臻', '蒸', '蕭', '虞', '覃', '談', '豪', '銜',
           '鐘', '陽', '青', '魂', '魚', '鹽', '麻', '齊'],
    "入": ['入', '舒'],
    "調": ['上', '入', '去', '平'],
    "清濁": ['全清', '全濁', '次清', '次濁', '清', '濁'],
    "系": ['幫', '知', '端', '見'],
    "組": ['幫', '影', '日', '曉', '泥', '知', '章', '端', '精', '莊', '見', '非'],
    "母": ['並', '云', '以', '來', '初', '匣', '奉', '娘', '定', '崇', '常', '幫', '影', '從', '微', '徹', '心',
           '敷', '日', '昌', '明', '曉', '書', '泥', '清', '溪', '滂', '澄', '生', '疑', '知', '禪', '章', '端',
           '精', '群', '船', '莊', '見', '透', '邪', '非']
}

S2T_T2S_MAPPING = {
    # 簡到繁
    '东': '東', '严': '嚴', '书': '書', '从': '從', '删': '刪', '帮': '幫',
    '并': '並', '庄': '莊', '废': '廢', '开': '開', '彻': '徹', '晓': '曉',
    '来': '來', '浊': '濁', '盐': '鹽', '禅': '禪', '萧': '蕭', '衔': '銜',
    '见': '見', '谈': '談', '阳': '陽', '鱼': '魚', '齐': '齊',
    # 繁到简
    '孃': '娘', '眞': '真', '羣': '群', '閤': '合', '雲': '云', '餚': '肴',
    '鹹': '咸', '鼕': '冬',
    "摄": "攝", "呼": "呼", "等": "等", "韵": "韻", "入": "入",
    "调": "調", "清浊": "清濁", "系": "系", "组": "組", "母": "母",
}

default_priority = [
    ("母", ["母", "組", "系"]),
    ("攝", ["攝", "韻"]),
    ("調", ["入", "調"]),
    ("清濁", ["清濁"]),
    ("等", ["等"]),
    ("呼", ["呼"]),
]

s2t_column = {
    "摄": "攝", "呼": "呼", "等": "等", "韵": "韻", "入": "入",
    "调": "調", "清浊": "清濁", "系": "系", "组": "組", "母": "母",
}

AMBIG_VALUES = {
    '咸', '山', '江', '臻', '微', '清',
    '莊', '幫', '知', '端', '見', '非',
    '影', '日', '曉', '泥', '章', '精'
}

custom_order = [
    'p', 'pʰ', 't', 'tʰ', 'k', 'kʰ', 'f', 'ʋ', 'ɸ', 'h',
    'x', 'l', 'n', 'm', 'ŋ', 'ɲ', 'ȵ', 'j', 'z', 's', 'ʃ',
    'ʂ', 'ɕ', 'θ', 'ɬ', 'b', 'd', 'g', 'ʒ', 'ʑ', 'ʐ',
    'ʦ', 'ʧ', 'ʨ', 'tʂ', 'tɹ', 'tr', 'tθ', 'dz', 'dʑ', 'dʐ', 'dʒ',
    'ʦʰ', 'ʧʰ', 'ʨʰ', 'tʂʰ', 'tɹʰ', 'trʰ', 'tθʰ', 'dzʰ', 'dʑʰ', 'dʐʰ', 'dʒʰ',
    'ʔ', 'a', 'ia', 'ua', 'ᴀ', 'ɑ', 'æ',
    'ɐ', 'iɐ', 'uɐ',
    'ə', 'iə', 'uə', 'ᴇ', 'ɛ', 'œ', 'iɛ', 'uɛ', 'ɜ', 'ɞ', 'ʌ',
    'ɔ', 'iɔ', 'uɔ', 'o', 'io', 'uo', 'ɤ', 'ɵ', 'ɘ',
    'ø', 'iø', 'e', 'ie', 'ʊ', 'u', 'ɯ', 'y', 'i', 'ɿ', 'ʮ',
    '陰平', '陰平甲', '陰平乙', '陽平', '陽平甲', '陽平乙', '陰上', '陰上甲', '陰上乙',
    '陽上', '陽上甲', '陽上乙', '陰去', '陰去甲', '陰去乙', '陽去', '陽去甲', '陽去乙',
    '陰入', '上陰入', '下陰入', '陽入', '上陽入', '下陽入', '變調', '變調1', '變調2', '輕聲',
]

TONE_MAP = {
    "1": "陰平", "1a": "陰平甲", "1b": "陰平乙", "1A": "陰平甲", "1B": "陰平乙",
    "2": "陽平", "2a": "陽平甲", "2b": "陽平乙", "2A": "陽平甲", "2B": "陽平乙",
    "3": "陰上", "3a": "陰上甲", "3b": "陰上乙", "3A": "陰上甲", "3B": "陰上乙",
    "4": "陽上", "4a": "陽上甲", "4b": "陽上乙", "4A": "陽上甲", "4B": "陽上乙",
    "5": "陰去", "5a": "陰去甲", "5b": "陰去乙", "5A": "陰去甲", "5B": "陰去乙",
    "6": "陽去", "6a": "陽去甲", "6b": "陽去乙", "6A": "陽去甲", "6B": "陽去乙",
    "7": "陰入", "7a": "上陰入", "7b": "下陰入", "7c": "陰入丙", "7A": "上陰入", "7B": "下陰入",
    "8": "陽入", "8a": "上陽入", "8b": "下陽入", "8A": "上陽入", "8B": "下陽入",
    "9": "變調", "9a": "變調1", "9b": "變調2", "0": "變調", "10": "輕聲", "輕聲": "輕聲"
}

col_map = {
    '漢字': ['漢字_程序改名', '單字', '#漢字', '单字', '漢字', 'phrase', '汉字'],
    '音標': ['IPA_程序改名', 'IPA', 'ipa', '音標', 'syllable'],
    '解釋': ['注釋_程序改名', '注释', '注釋', '解釋', 'notes']
}

exclude_files = [
    "鄭張上古", "白-沙上古", "新最小上古", "廣韻", "盛唐", "中唐", "北宋", "蒙古字韻",
    "中原音韻", "洪武正韻", "西儒耳目資", "普通話", "党項", "1561越葡拉", "越南", "中世朝鮮", "朝鮮",
    "日語吳音", "日語漢音", "日語其他", "崑曲", "京劇", "黃梅戲", "黃梅採茶戲", "隨州花鼓戏",
    "淮劇", "越劇", "贛劇", "南昌採茶戲", "撫州採茶戲", "吉安採茶戲", "星子西河戲", "巴陵戲",
    "湘劇", "長沙花鼓戲", "邕劇", "潮劇", "古腔粵劇", "邵武三角戲", "政和楊源四平戲", "蘇州評彈",
    "香港", "東干甘肅話", "臺灣", "國語"
]

replace_data = [
    # 韻腹
    ['aa', 'a', 'wf'], ['a', 'ɐ', 'wf'], ['e', 'ɛ', 'wf'], ['ea', 'ə', 'wf'], ['uu', 'ʊ', 'wf'],
    ['oe', 'œ', 'wf'], ['eo', 'ɵ', 'wf'], ['y', 'y', 'wf'], ['o', 'ɔ', 'wf'],
    ['uu', 'ʊ', 'wf'], ['ii', 'ɪ', 'wf'],
    ['or', 'ɤ', 'wf'], ['ar', 'ɑ', 'wf'], ['dd', 'ɗ', 'wf'],
    # ['uu', 'u', 'wf'], ['u', 'ʊ', 'wf'],
    # 聲母
    ['ng', 'ŋ', 'sm'], ['nj', 'ȵ', 'sm'], ['sl', 'ɬ', 'sm'],
    ['th', 'θ', 'sm'], ['bb', 'ɓ', 'sm'], ['dd', 'ɗ', 'sm'],
    ['zh', 'ʧ', 'sm'], ['ch', 'ʧʰ', 'sm'], ['sh', 'ʃ', 'sm'],
    ['zj', 'ʨ', 'sm'], ['cj', 'ʨʰ', 'sm'], ['sj', 'ɕ', 'sm'], ['q', 'ʔ', 'sm'],
    ['c', 'ʦʰ', 'sm'], ['z', 'ʦ', 'sm'], ['d', 't', 'sm'], ['t', 'tʰ', 'sm'],
    ['g', 'k', 'sm'], ['k', 'kʰ', 'sm'], ['b', 'p', 'sm'], ['p', 'pʰ', 'sm'],
    # ['s', 's', 'sm'],
    # 聲調
    ['1', '454', 'jd'], ['2', '33', 'jd'], ['3', '42', 'jd'],
    ['4', '232', 'jd'], ['5', '23', 'jd'], ['6', '21', 'jd'],
    ['7', '5', 'jd'], ['8', '4', 'jd'], ['9', '2', 'jd'], ['10', '22', 'jd'],
    # 韻尾
    ['ng', 'ŋ', 'wm'], ['h', 'ʔ', 'wm'], ['n', 'n', 'wm'], ['m', 'm', 'wm']
]

custom_variant_dict = {
    "淸": "清", "鄕": "鄉", "鐵": "鉄", "髙": "高", "郞": "郎", "屛": "屏",
    "靑": "青", "尙": "尚", "郉": "邢", "楡": "榆", "峯": "峰", "鎭": "鎮",
    "巖": "岩", "黃": "黃", "甯": "寧",
    # 如需可再擴充
}

vowel_pattern = r"[iyɨʉɯuɪʏɿʅʅɭıɪſɩɷʮɥʯʊeɘɵəɤoοоɛεɝɚᴇœɜɞʌɔæaɶɑɒᴀɐãẽĩỹõúαᵘᶷᶤᶶᵚʸᶦᵊⁱ◌øɻβʝɹǝуеṃṇīā∅Ø]"
